comsys/networkarchitecture.html
<p>
Der Begriff der <i>Netzwerkarchitektur</i> wird uneinheitlich verwendet.
Gemeint sein kann:
</p>

<ul class="org-ul">
<li>die Spezifikation der Kommunikation in einem Netztwerk mit Schichten
und Protokollen, z.B.:

<ul class="org-ul">
<li>ISO/OSI RM
</li>
<li>Internetarchitektur (RFC 1122)
</li>
<li>JAVA RMI
</li>
</ul>
</li>

<li>der Aufbau eines Netzwerks im Sinne von

<ul class="org-ul">
<li>Topologie
</li>
<li>Abdeckung
</li>
<li>Vermittlung (connectionless oder connection-oriented switching)
</li>
<li>Übertragungsmedium
</li>
<li>etc.
</li>
</ul>
</li>
</ul>
